// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
//456 -> 6
//782 -> 2
//918 -> 8

int digit3 = 456 % 10;
Console.WriteLine(digit3);

int digit1 = 782 % 10;
Console.WriteLine(digit1);

int digit2 = 918 % 10;
Console.WriteLine(digit2);
