//Напишите программу, которая на вход принимает число и выдает, является ли число четным (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет

int digit3 = -3 % 2;
Console.WriteLine(digit3);
if (digit3 == 0);
{
        Console.WriteLine("Да");
}

